Public Attributes | List of all members
API_StairStructureSymbolData Struct Reference
Element Manager API
Represents the data of a 2D symbol a Stair's Structure elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_AttributeIndex  | visibleLineType
Type of the visible lines.
short  | visibleLinePen
Pen of the visible lines.
short  | hiddenLinePen
Pen of the hidden lines.
API_AttributeIndex  | hiddenLineType
Type of the hidden lines.
API_AttributeIndex  | visibleFillType
Type of the visible fills.
short  | visibleFillPen
Pen of the visible fills.
short  | visibleFillBackgroundPen
Pen of the visible background fills.
API_AttributeIndex  | hiddenFillType
Type of the hidden fills.
short  | hiddenFillPen
Pen of the hidden fills.
short  | hiddenFillBackgroundPen
Pen of the hidden background fills.
Detailed Description
Represents the data of a 2D symbol a Stair's Structure elements.
Member Data Documentation
◆ hiddenFillBackgroundPen
 API_StairStructureSymbolData::hiddenFillBackgroundPen
Pen of the hidden background fills.
◆ hiddenFillPen
 API_StairStructureSymbolData::hiddenFillPen
Pen of the hidden fills.
◆ hiddenFillType
 API_StairStructureSymbolData::hiddenFillType
Type of the hidden fills.
◆ hiddenLinePen
 API_StairStructureSymbolData::hiddenLinePen
Pen of the hidden lines.
◆ hiddenLineType
 API_StairStructureSymbolData::hiddenLineType
Type of the hidden lines.
◆ visibleFillBackgroundPen
 API_StairStructureSymbolData::visibleFillBackgroundPen
Pen of the visible background fills.
◆ visibleFillPen
 API_StairStructureSymbolData::visibleFillPen
Pen of the visible fills.
◆ visibleFillType
 API_StairStructureSymbolData::visibleFillType
Type of the visible fills.
◆ visibleLinePen
 API_StairStructureSymbolData::visibleLinePen
Pen of the visible lines.
◆ visibleLineType
 API_StairStructureSymbolData::visibleLineType
Type of the visible lines.